bluekitchen/btstack/port/stm32-f4discovery-csr8x11/doc/STMicro/STM32H7x5_CM7.svd
        <register>
          <name>SAI_BCR2</name>
          <displayName>SAI_BCR2</displayName>
          <description>Configuration register 2</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FTH</name>
              <description>FIFO threshold. This bit is set and
              cleared by software.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FFLUSH</name>
              <description>FIFO flush. This bit is set by software.
              It is always read as 0. This bit should be configured
              when the SAI is disabled.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TRIS</name>
              <description>Tristate management on data line. This
              bit is set and cleared by software. It is meaningful
              only if the audio block is configured as a
              transmitter. This bit is not used when the audio
              block is configured in SPDIF mode. It should be
              configured when SAI is disabled. Refer to Section:
              Output data line management on an inactive slot for
              more details.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MUTE</name>
              <description>Mute. This bit is set and cleared by
              software. It is meaningful only when the audio block
              operates as a transmitter. The MUTE value is linked
              to value of MUTEVAL if the number of slots is lower
              or equal to 2, or equal to 0 if it is greater than 2.
              Refer to Section: Mute mode for more details. Note:
              This bit is meaningless and should not be used for
              SPDIF audio blocks.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MUTEVAL</name>
              <description>Mute value. This bit is set and cleared
              by software.It must be written before enabling the
              audio block: SAIXEN. This bit is meaningful only when
              the audio block operates as a transmitter, the number
              of slots is lower or equal to 2 and the MUTE bit is
              set. If more slots are declared, the bit value sent
              during the transmission in mute mode is equal to 0,
              whatever the value of MUTEVAL. if the number of slot
              is lower or equal to 2 and MUTEVAL = 1, the MUTE
              value transmitted for each slot is the one sent
              during the previous frame. Refer to Section: Mute
              mode for more details. Note: This bit is meaningless
              and should not be used for SPDIF audio
              blocks.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MUTECNT</name>
              <description>Mute counter. These bits are set and
              cleared by software. They are used only in reception
              mode. The value set in these bits is compared to the
              number of consecutive mute frames detected in
              reception. When the number of mute frames is equal to
              this value, the flag MUTEDET will be set and an
              interrupt will be generated if bit MUTEDETIE is set.
              Refer to Section: Mute mode for more
              details.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CPL</name>
              <description>Complement bit. This bit is set and
              cleared by software. It defines the type of
              complement to be used for companding mode Note: This
              bit has effect only when the companding mode is -Law
              algorithm or A-Law algorithm.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COMP</name>
              <description>Companding mode. These bits are set and
              cleared by software. The -Law and the A-Law log are a
              part of the CCITT G.711 recommendation, the type of
              complement that will be used depends on CPL bit. The
              data expansion or data compression are determined by
              the state of bit MODE[0]. The data compression is
              applied if the audio block is configured as a
              transmitter. The data expansion is automatically
              applied when the audio block is configured as a
              receiver. Refer to Section: Companding mode for more
              details. Note: Companding mode is applicable only
              when TDM is selected.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAI_BFRCR</name>
          <displayName>SAI_BFRCR</displayName>
          <description>This register has no meaning in AC97 and
          SPDIF audio protocol</description>
          <addressOffset>0x2C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000007</resetValue>
          <fields>
            <field>
              <name>FRL</name>
              <description>Frame length. These bits are set and
              cleared by software. They define the audio frame
              length expressed in number of SCK clock cycles: the
              number of bits in the frame is equal to FRL[7:0] + 1.
              The minimum number of bits to transfer in an audio
              frame must be equal to 8, otherwise the audio block
              will behaves in an unexpected way. This is the case
              when the data size is 8 bits and only one slot 0 is
              defined in NBSLOT[4:0] of SAI_xSLOTR register
              (NBSLOT[3:0] = 0000). In master mode, if the master
              clock (available on MCLK_x pin) is used, the frame
              length should be aligned with a number equal to a
              power of 2, ranging from 8 to 256. When the master
              clock is not used (NODIV = 1), it is recommended to
              program the frame length to an value ranging from 8
              to 256. These bits are meaningless and are not used
              in AC97 or SPDIF audio block
              configuration.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FSALL</name>
              <description>Frame synchronization active level
              length. These bits are set and cleared by software.
              They specify the length in number of bit clock (SCK)
              + 1 (FSALL[6:0] + 1) of the active level of the FS
              signal in the audio frame These bits are meaningless
              and are not used in AC97 or SPDIF audio block
              configuration. They must be configured when the audio
              block is disabled.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FSDEF</name>
              <description>Frame synchronization definition. This
              bit is set and cleared by software. When the bit is
              set, the number of slots defined in the SAI_xSLOTR
              register has to be even. It means that half of this
              number of slots will be dedicated to the left channel
              and the other slots for the right channel (e.g: this
              bit has to be set for I2S or MSB/LSB-justified
              protocols...). This bit is meaningless and is not
              used in AC97 or SPDIF audio block configuration. It
              must be configured when the audio block is
              disabled.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FSPOL</name>
              <description>Frame synchronization polarity. This bit
              is set and cleared by software. It is used to
              configure the level of the start of frame on the FS
              signal. It is meaningless and is not used in AC97 or
              SPDIF audio block configuration. This bit must be
              configured when the audio block is
              disabled.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FSOFF</name>
              <description>Frame synchronization offset. This bit
              is set and cleared by software. It is meaningless and
              is not used in AC97 or SPDIF audio block
              configuration. This bit must be configured when the
              audio block is disabled.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAI_BSLOTR</name>
          <displayName>SAI_BSLOTR</displayName>
          <description>This register has no meaning in AC97 and
          SPDIF audio protocol</description>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FBOFF</name>
              <description>First bit offset These bits are set and
              cleared by software. The value set in this bitfield
              defines the position of the first data transfer bit
              in the slot. It represents an offset value. In
              transmission mode, the bits outside the data field
              are forced to 0. In reception mode, the extra
              received bits are discarded. These bits must be set
              when the audio block is disabled. They are ignored in
              AC97 or SPDIF mode.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>SLOTSZ</name>
              <description>Slot size This bits is set and cleared
              by software. The slot size must be higher or equal to
              the data size. If this condition is not respected,
              the behavior of the SAI will be undetermined. Refer
              to Section: Output data line management on an
              inactive slot for information on how to drive SD
              line. These bits must be set when the audio block is
              disabled. They are ignored in AC97 or SPDIF
              mode.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>NBSLOT</name>
              <description>Number of slots in an audio frame. These
              bits are set and cleared by software. The value set
              in this bitfield represents the number of slots + 1
              in the audio frame (including the number of inactive
              slots). The maximum number of slots is 16. The number
              of slots should be even if FSDEF bit in the SAI_xFRCR
              register is set. The number of slots must be
              configured when the audio block is disabled. They are
              ignored in AC97 or SPDIF mode.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>SLOTEN</name>
              <description>Slot enable. These bits are set and
              cleared by software. Each SLOTEN bit corresponds to a
              slot position from 0 to 15 (maximum 16 slots). The
              slot must be enabled when the audio block is
              disabled. They are ignored in AC97 or SPDIF
              mode.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SAI_BIM</name>
          <displayName>SAI_BIM</displayName>
          <description>Interrupt mask register 2</description>
          <addressOffset>0x34</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>OVRUDRIE</name>
              <description>Overrun/underrun interrupt enable. This
              bit is set and cleared by software. When this bit is
              set, an interrupt is generated if the OVRUDR bit in
              the SAI_xSR register is set.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MUTEDETIE</name>
              <description>Mute detection interrupt enable. This
              bit is set and cleared by software. When this bit is
              set, an interrupt is generated if the MUTEDET bit in
              the SAI_xSR register is set. This bit has a meaning
              only if the audio block is configured in receiver
              mode.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WCKCFGIE</name>
              <description>Wrong clock configuration interrupt
              enable. This bit is set and cleared by software. This
              bit is taken into account only if the audio block is
              configured as a master (MODE[1] = 0) and NODIV = 0.
              It generates an interrupt if the WCKCFG flag in the
              SAI_xSR register is set. Note: This bit is used only
              in TDM mode and is meaningless in other
              modes.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FREQIE</name>
              <description>FIFO request interrupt enable. This bit
              is set and cleared by software. When this bit is set,
              an interrupt is generated if the FREQ bit in the
              SAI_xSR register is set. Since the audio block
              defaults to operate as a transmitter after reset, the
              MODE bit must be configured before setting FREQIE to
              avoid a parasitic interruption in receiver
              mode,</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CNRDYIE</name>
              <description>Codec not ready interrupt enable (AC97).
              This bit is set and cleared by software. When the
              interrupt is enabled, the audio block detects in the
              slot 0 (tag0) of the AC97 frame if the Codec
              connected to this line is ready or not. If it is not
              ready, the CNRDY flag in the SAI_xSR register is set
              and an interruption i generated. This bit has a
              meaning only if the AC97 mode is selected through
              PRTCFG[1:0] bits and the audio block is operates as a
              receiver.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AFSDETIE</name>
              <description>Anticipated frame synchronization
              detection interrupt enable. This bit is set and
              cleared by software. When this bit is set, an
              interrupt will be generated if the AFSDET bit in the
              SAI_xSR register is set. This bit is meaningless in
              AC97, SPDIF mode or when the audio block operates as
              a master.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LFSDETIE</name>
              <description>Late frame synchronization detection
              interrupt enable. This bit is set and cleared by
              software. When this bit is set, an interrupt will be
              generated if the LFSDET bit is set in the SAI_xSR
              register. This bit is meaningless in AC97, SPDIF mode
              or when the audio block operates as a
              master.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SAI_BSR</name>
          <displayName>SAI_BSR</displayName>
          <description>Status register</description>
          <addressOffset>0x38</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000008</resetValue>
          <fields>
            <field>
              <name>OVRUDR</name>
              <description>Overrun / underrun. This bit is read
              only. The overrun and underrun conditions can occur
              only when the audio block is configured as a receiver
              and a transmitter, respectively. It can generate an
              interrupt if OVRUDRIE bit is set in SAI_xIM register.
              This flag is cleared when the software sets COVRUDR
              bit in SAI_xCLRFR register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MUTEDET</name>
              <description>Mute detection. This bit is read only.
              This flag is set if consecutive 0 values are received
              in each slot of a given audio frame and for a
              consecutive number of audio frames (set in the
              MUTECNT bit in the SAI_xCR2 register). It can
              generate an interrupt if MUTEDETIE bit is set in
              SAI_xIM register. This flag is cleared when the
              software sets bit CMUTEDET in the SAI_xCLRFR
              register.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WCKCFG</name>
              <description>Wrong clock configuration flag. This bit
              is read only. This bit is used only when the audio
              block operates in master mode (MODE[1] = 0) and NODIV
              = 0. It can generate an interrupt if WCKCFGIE bit is
              set in SAI_xIM register. This flag is cleared when
              the software sets CWCKCFG bit in SAI_xCLRFR
              register.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FREQ</name>
              <description>FIFO request. This bit is read only. The
              request depends on the audio block configuration: If
              the block is configured in transmission mode, the
              FIFO request is related to a write request operation
              in the SAI_xDR. If the block configured in reception,
              the FIFO request related to a read request operation
              from the SAI_xDR. This flag can generate an interrupt
              if FREQIE bit is set in SAI_xIM
              register.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CNRDY</name>
              <description>Codec not ready. This bit is read only.
              This bit is used only when the AC97 audio protocol is
              selected in the SAI_xCR1 register and configured in
              receiver mode. It can generate an interrupt if
              CNRDYIE bit is set in SAI_xIM register. This flag is
              cleared when the software sets CCNRDY bit in
              SAI_xCLRFR register.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AFSDET</name>
              <description>Anticipated frame synchronization
              detection. This bit is read only. This flag can be
              set only if the audio block is configured in slave
              mode. It is not used in AC97or SPDIF mode. It can
              generate an interrupt if AFSDETIE bit is set in
              SAI_xIM register. This flag is cleared when the
              software sets CAFSDET bit in SAI_xCLRFR
              register.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LFSDET</name>
              <description>Late frame synchronization detection.
              This bit is read only. This flag can be set only if
              the audio block is configured in slave mode. It is
              not used in AC97 or SPDIF mode. It can generate an
              interrupt if LFSDETIE bit is set in the SAI_xIM
              register. This flag is cleared when the software sets
              bit CLFSDET in SAI_xCLRFR register</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLVL</name>
              <description>FIFO level threshold. This bit is read
              only. The FIFO level threshold flag is managed only
              by hardware and its setting depends on SAI block
              configuration (transmitter or receiver mode). If the
              SAI block is configured as transmitter: If SAI block
              is configured as receiver:</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
